### Missing Data.

In [1]:
import numpy as np
import pandas as pd

### Pandas utility functions
- Similarly to numpy, pandas also has a few utility functions to identify and detect null values:

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(np.nan)

True

In [5]:
pd.isna(None)

True

- The opposite ones also exist:

In [6]:
pd.notnull(None)

False

In [7]:
pd.notnull(np.nan)

False

In [8]:
pd.notnull(3)

True

- These functions also work with Series and DataFrames:

In [10]:
pd.isnull(pd.Series([1,np.nan,6]))

0    False
1     True
2    False
dtype: bool

In [11]:
pd.notnull(pd.Series([1,45,np.nan,7]))

0     True
1     True
2    False
3     True
dtype: bool

In [12]:
pd.isnull(pd.DataFrame({'Col1':[12,67,89,np.nan],'col2':[54,89, np.nan,76],'col3':[12,np.nan,34,70]}))

    Col1   col2   col3
0  False  False  False
1  False  False   True
2  False   True  False
3   True  False  False

### Pandas Operations with Missing Values
- Pandas manages missing values more gracefully than numpy. nans will no longer behave as "viruses", and operations will just ignore them completely:

In [13]:
pd.Series([1, 2, np.nan]).count()

2

In [14]:
pd.Series([1, 2, np.nan]).sum()

3.0

In [15]:
pd.Series([1,2,np.nan]).mean()

1.5

### Filtering missing data.
- As we saw with numpy, we could combine boolean selection + pd.isnull to filter out those nans and null values:

In [17]:
ser =pd.Series([12,np.nan,67,98,87,56,np.nan])

In [20]:
ser.notnull().sum()

5

In [22]:
pd.notnull(ser).count()

7

In [23]:
ser[ser.notnull()]

0    12.0
2    67.0
3    98.0
4    87.0
5    56.0
dtype: float64

- But both notnull and isnull are also methods of Series and DataFrames, so we could use it that way:

In [24]:
ser.isnull()

0    False
1     True
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [25]:
ser.notnull()

0     True
1    False
2     True
3     True
4     True
5     True
6    False
dtype: bool

In [26]:
ser[ser.notnull()]

0    12.0
2    67.0
3    98.0
4    87.0
5    56.0
dtype: float64

### Dropping null values
- Boolean selection + notnull() seems a little bit verbose and repetitive. And as we said before: any repetitive task will probably have a better, more DRY way. In this case, we can use the dropna method:

In [27]:
ser.dropna()

0    12.0
2    67.0
3    98.0
4    87.0
5    56.0
dtype: float64

### Dropping null values on DataFrames.
- You saw how simple it is to drop nas with a Series. But with DataFrames, there will be a few more things to consider, because you can't drop single values. You can only drop entire columns or rows. Let's start with a sample DataFrame:

In [28]:
df = pd.DataFrame({'COL1':[27,87,65,np.nan,np.nan],'COL2':[np.nan,72,71,np.nan,90],'COL3':[66,np.nan,55,90,61]})

In [29]:
df.head()

   COL1  COL2  COL3
0  27.0   NaN  66.0
1  87.0  72.0   NaN
2  65.0  71.0  55.0
3   NaN   NaN  90.0
4   NaN  90.0  61.0

In [30]:
df.isnull()

    COL1   COL2   COL3
0  False   True  False
1  False  False   True
2  False  False  False
3   True   True  False
4   True  False  False

In [31]:
df.isnull().sum()

COL1    2
COL2    2
COL3    1
dtype: int64

In [32]:
df.dropna()

   COL1  COL2  COL3
2  65.0  71.0  55.0

- In this case we're dropping rows. Rows containing null values are dropped from the DF. You can also use the axis parameter to drop columns containing null values:

In [33]:
df.dropna(axis=1)  # axis='columns' also works

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]


- In this case, any row or column that contains at least one null value will be dropped. Which can be, depending on the case, too extreme. **You can control this behavior with the how parameter. Can be either 'any' or 'all':**

In [34]:
df2 = pd.DataFrame({'CO1':[12,87,87,90,np.nan],'CO2':[23,np.nan,np.nan,78,90],'CO3':[55,90,76,12,34],'CO4':[np.nan,np.nan,89,90,54]})

In [35]:
df2

    CO1   CO2  CO3   CO4
0  12.0  23.0   55   NaN
1  87.0   NaN   90   NaN
2  87.0   NaN   76  89.0
3  90.0  78.0   12  90.0
4   NaN  90.0   34  54.0

In [37]:
df2.dropna(how='all',axis=1)

    CO1   CO2  CO3   CO4
0  12.0  23.0   55   NaN
1  87.0   NaN   90   NaN
2  87.0   NaN   76  89.0
3  90.0  78.0   12  90.0
4   NaN  90.0   34  54.0

In [38]:
df2.dropna(how='any') #rowwise dropna done atleast one np.nan avalible is responsible to drop row.

    CO1   CO2  CO3   CO4
3  90.0  78.0   12  90.0

In [40]:
df2.dropna(how='any',axis=1) #columns-wise dropna done atleast one np.nan avalible is responsible to drop columns.

   CO3
0   55
1   90
2   76
3   12
4   34

- You can also use the thresh parameter to indicate a threshold (a minimum number) of non-null values for the row/column to be kept:

In [41]:
df

   COL1  COL2  COL3
0  27.0   NaN  66.0
1  87.0  72.0   NaN
2  65.0  71.0  55.0
3   NaN   NaN  90.0
4   NaN  90.0  61.0

In [45]:
df.dropna(thresh=3) #mininum 3 not value required

   COL1  COL2  COL3
2  65.0  71.0  55.0

In [47]:
df.dropna(thresh=2)

   COL1  COL2  COL3
0  27.0   NaN  66.0
1  87.0  72.0   NaN
2  65.0  71.0  55.0
4   NaN  90.0  61.0

In [53]:
df2.dropna(thresh=2,axis='columns')

    CO1   CO2  CO3   CO4
0  12.0  23.0   55   NaN
1  87.0   NaN   90   NaN
2  87.0   NaN   76  89.0
3  90.0  78.0   12  90.0
4   NaN  90.0   34  54.0

### Filling null values
- Sometimes instead than dropping the null values, we might need to replace them with some other value. This highly depends on your context and the dataset you're currently working. Sometimes a nan can be replaced with a 0, sometimes it can be replaced with the mean of the sample, and some other times you can take the closest value. Again, it depends on the context. We'll show you the different methods and mechanisms and you can then apply them to your own problem.

In [54]:
ser

0    12.0
1     NaN
2    67.0
3    98.0
4    87.0
5    56.0
6     NaN
dtype: float64

#### Filling nulls with a arbitrary value.

In [55]:
ser.fillna(0)

0    12.0
1     0.0
2    67.0
3    98.0
4    87.0
5    56.0
6     0.0
dtype: float64

In [56]:
ser.fillna(ser.mean())

0    12.0
1    64.0
2    67.0
3    98.0
4    87.0
5    56.0
6    64.0
dtype: float64

In [57]:
ser

0    12.0
1     NaN
2    67.0
3    98.0
4    87.0
5    56.0
6     NaN
dtype: float64

#### Filling nulls with contiguous (close) values.

- The method argument is used to fill null values with other values close to that null one:

In [60]:
ser

0    12.0
1     NaN
2    67.0
3    98.0
4    87.0
5    56.0
6     NaN
dtype: float64

In [58]:
ser.fillna(method='ffill')

0    12.0
1    12.0
2    67.0
3    98.0
4    87.0
5    56.0
6    56.0
dtype: float64

In [59]:
ser.fillna(method='bfill')

0    12.0
1    67.0
2    67.0
3    98.0
4    87.0
5    56.0
6     NaN
dtype: float64

- This can still leave null values at the extremes of the Series/DataFrame:

In [61]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [62]:
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    NaN
4    NaN
dtype: float64

#### Filling null values on DataFrames
- The fillna method also works on DataFrames, and it works similarly. The main differences are that you can specify the axis (as usual, rows or columns) to use to fill the values (specially for methods) and that you have more control on the values passed:

In [63]:
df

   COL1  COL2  COL3
0  27.0   NaN  66.0
1  87.0  72.0   NaN
2  65.0  71.0  55.0
3   NaN   NaN  90.0
4   NaN  90.0  61.0

In [66]:
df.fillna({'COL1':9,'COL2':70,'COL3':df['COL3'].mean()})

   COL1  COL2  COL3
0  27.0  70.0  66.0
1  87.0  72.0  68.0
2  65.0  71.0  55.0
3   9.0  70.0  90.0
4   9.0  90.0  61.0

In [67]:
df.fillna(method='ffill', axis=0)

   COL1  COL2  COL3
0  27.0   NaN  66.0
1  87.0  72.0  66.0
2  65.0  71.0  55.0
3  65.0  71.0  90.0
4  65.0  90.0  61.0

In [68]:
df.fillna(method='ffill', axis=1)

   COL1  COL2  COL3
0  27.0  27.0  66.0
1  87.0  72.0  72.0
2  65.0  71.0  55.0
3   NaN   NaN  90.0
4   NaN  90.0  61.0

### Checking if there are NAs
- The question is: Does this Series or DataFrame contain any missing value? The answer should be yes or no: True or False. How can you verify it?

- Example 1: Checking the length

- If there are missing values, ser.dropna() will have less elements than ser:

In [70]:
ser.dropna().count()

5

In [73]:
missing_values = len(ser.dropna())!=len(ser)
missing_values

True

- There's also a count method, that excludes nans from its result:

In [74]:
len(ser)

7

In [75]:
ser.count()

5

So we could just do:

In [77]:
missing_values = ser.count() != len(ser)
missing_values

True

#### More Pythonic solution any

- **The methods any and all check if either there's any True value in a Series or all the values are True. They work in the same way as in Python.**

In [78]:
pd.Series([True, False, False]).any()

True

In [80]:
pd.Series([True, False, False]).all()

False

In [81]:
pd.Series([True, True, True]).all()

True

- The isnull() method returned a Boolean Series with True values wherever there was a nan:

In [82]:
ser.isnull()

0    False
1     True
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [83]:
ser.isnull().any()

True

In [84]:
ser.isnull().all()

False

- A more strict version would check only the values of the Series:

In [88]:
ser.isnull().values

array([False,  True, False, False, False, False,  True])

In [89]:
ser.isnull().values.any()

True